client/app/ews/exchange_soap_updatedattendees_template.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
               xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
               xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" 
               xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types">
   <soap:Header>
    <t:RequestServerVersion Version="Exchange2010"/>
  </soap:Header>
  <soap:Body>
    <UpdateItem MessageDisposition="SendAndSaveCopy" ConflictResolution="AlwaysOverwrite" SendMeetingInvitationsOrCancellations="SendToChangedAndSaveCopy"
                xmlns="http://schemas.microsoft.com/exchange/services/2006/messages">
      <ItemChanges>
        <t:ItemChange>
          <t:ItemId Id="<%= exchangeUid %>" ChangeKey="<%= changeKey %>"/>
          <t:Updates>
          <%  ["RequiredAttendees", "OptionalAttendees", "Resources"].map(function(at) {

              	// only if one of the Attendeelist is set, proceed
              	if (typeof Attendeelist["t:"+at] != "undefined") {
              	              		 
           %>
	    <t:SetItemField>             
              <t:FieldURI FieldURI="calendar:<%= at %>" />
              <t:CalendarItem>
                <t:<%= at %>>
                   <% 
                  
                  for (var i = 0; i < Attendeelist["t:"+at].length; i++) {  
                  
                   	// do not print the Ressource at all, if we have more than one
                   	// recipient in the respective attendeelist
                  	if (  Attendeelist["t:"+at][i]["EmailAddress"] == eMail 
                  			&& Attendeelist["t:"+at].length > 1) {
                  	 	continue;
                  	}
              %>  
                  <t:Attendee>
                    <t:Mailbox>
                 <%
                   // Cater for the case that only the ressource is part of a Attendee-list
                   // then we need to replace the room with a dummy
                   // as otherwise Exchange will not send a cancelation-message
                   if ( Attendeelist["t:"+at].length == 1 &&
                    	Attendeelist["t:"+at][0]["EmailAddress"] == eMail ) {
				      	
              %>        
                    	<t:Name>MR Room canceled via bridge</t:Name>
	               		<t:EmailAddress>do.not.reply@sap.com</t:EmailAddress>     
                      	<t:RoutingType>SMTP</t:RoutingType>                    
                <% } else { %>
                      <t:Name><%= Attendeelist["t:"+at][i]["Name"] %></t:Name>  
                      <t:EmailAddress><%= Attendeelist["t:"+at][i]["EmailAddress"] %></t:EmailAddress>
                      <t:RoutingType><%= Attendeelist["t:"+at][i]["RoutingType"] %></t:RoutingType>
                <% } %>

                    </t:Mailbox>

                  </t:Attendee>
              <% } %>
                </t:<%= at %>>
              </t:CalendarItem>
            </t:SetItemField>
            <%
			   }
		   });
            %>
          </t:Updates>
        </t:ItemChange>
      </ItemChanges>
    </UpdateItem>
  </soap:Body>
</soap:Envelope>
